% clear all;
format long e;

global e;
global en;
global I;
global index;
index=0;
delete('backup/time','backup/N','backup/E','backup/T');
I=0;
%--спектроскопические постоянные-------------------------------------------
x1=[2169.81 , 13.288 , 0.0105 ];                            %для всех х: х=[we, wexe, weye] X1sigma+
x2=[1743.41 , 14.36 , -0.045 ];                             %a3Pi
x3=[1518.24 , 19.4, 0.766];                                 %A1Pi
%--кол-во колебательных уровней в каждом электронном состоянии-------------
% j1=68;
% j2=34;
% j3=18;
%--------------------------------------------------------------------------
global T0;
global T1;
global bolcman;
global myu;
global n0;
global tau0;
%--------------------------------------------------------------------------
T0=500;                         %K
T1=5000;                        %K
O=[0,48686.7,65075.77];         %энергия электронных уровней X1Sigma+,a3Pi,A1Pi cm^(-1)
bolcman=1.380648813*10^-23;     %Дж/К
diam=3.5*10^(-10);              %m
R_gas=8.31;                     %Дж/К/моль
myu=0.028;                      %кг/моль
p0=10^5;                        %Pa
n0=p0/(bolcman*T0);             %m^(-3)
tau0=bolcman*sqrt(myu*T0/(6*R_gas))/(pi*diam^2*p0);%с
%--------------------------------------------------------------------------
y000=[1:1:68]; 
n4=(nc_bolc777(T0,68,x1,O(1)))';
n5=(nc_bolc777(T0,34,x2,O(2)))';
n5(15)=n5(15)+1.290328189*10^(-61);
n5(1)=n5(1)-1.290328189*10^(-61);
display(n5);
% n40=(nc_2(T0, T1, O(1), 68, x1))';
% a=sum(n40);
% n50=(nc_2(T0, T1, O(2), 34, x2))';
% b=sum(n50);
e=energy_el(1);
en=energy_el(2);
y333=[n4;n5;1];
buratino=Rigth_hand(y333,e,en,tau0,n0,T0);
options=odeset('InitialStep',10e-30,'MaxStep',10e-2);
[t, Y]=ode15s(@Solve,[0,1e+6],y333,options);


